{
  "table_name": "snippet_parts",
  "backup_date": "2025-04-12",
  "columns": [
    "part_id",
    "snippet_id",
    "part_number",
    "content"
  ],
  "data": [
    {
      "part_id": 1,
      "snippet_id": 1,
      "part_number": 0,
      "content": "The Quick brown fox jumps under the lazy dog."
    },
    {
      "part_id": 2,
      "snippet_id": 2,
      "part_number": 0,
      "content": "I\n\nMidwinter spring is its own season\nSempiternal though sodden towards sundown,\nSuspended in time, between pole and tropic.\nWhen the short day is brightest, with frost and fire,\nThe brief sun flames the ice, on pond and ditches,\nIn windless cold that is the heart's heat,\nReflecting in a watery mirror\nA glare that is blindness in the early afternoon.\nAnd glow more intense than blaze of branch, or brazier,\nStirs the dumb spirit: no wind, but pentecostal fire\nIn the dark time of the year. Between melting and freezing\nThe soul's sap quivers. There is no earth smell\nOr smell of living thing. This is the spring time\nBut not in time's covenant. Now the hedgerow\nIs blanched for an hour with transitory blossom\nOf snow, a bloom more sudden\nThan that of summer, neither budding nor fading,\nNot in the scheme of generation.\nWhere is the summer, the unimaginable\nZero summer?\n\nIf you came this way,\nTaking the route you would be likely to take\nFrom the place you would be likely to come from,\nIf you ca"
    },
    {
      "part_id": 3,
      "snippet_id": 2,
      "part_number": 1,
      "content": "me this way in may time, you would find the hedges\nWhite again, in May, with voluptuary sweetness.\nIt would be the same at the end of the journey,\nIf you came at night like a broken king,\nIf you came by day not knowing what you came for,\nIt would be the same, when you leave the rough road\nAnd turn behind the pig-sty to the dull facade\nAnd the tombstone. And what you thought you came for\nIs only a shell, a husk of meaning\nFrom which the purpose breaks only when it is fulfilled\nIf at all. Either you had no purpose\nOr the purpose is beyond the end you figured\nAnd is altered in fulfilment. There are other places\nWhich also are the world's end, some at the sea jaws,\nOr over a dark lake, in a desert or a city—\nBut this is the nearest, in place and time,\nNow and in England.\n\nIf you came this way,\nTaking any route, starting from anywhere,\nAt any time or at any season,\nIt would always be the same: you would have to put off\nSense and notion. You are not here to verify,\nInstruct yourself, or info"
    },
    {
      "part_id": 4,
      "snippet_id": 2,
      "part_number": 2,
      "content": "rm curiosity\nOr carry report. You are here to kneel\nWhere prayer has been valid. And prayer is more\nThan an order of words, the conscious occupation\nOf the praying mind, or the sound of the voice praying.\nAnd what the dead had no speech for, when living,\nThey can tell you, being dead: the communication\nOf the dead is tongued with fire\nBeyond the language of the living.\nHere, the intersection of the timeless moment\nIs England and nowhere. Never and always.\n\n\nII\n\nAsh on and old man's sleeve\nIs all the ash the burnt roses leave.\nDust in the air suspended\nMarks the place where a story ended.\nDust inbreathed was a house—\nThe walls, the wainscot and the mouse,\nThe death of hope and despair,\nThis is the death of air.\n\nThere are flood and drouth\nOver the eyes and in the mouth,\nDead water and dead sand\nContending for the upper hand.\nThe parched eviscerate soil\nGapes at the vanity of toil,\nLaughs without mirth.\nThis is the death of earth.\n\nWater and fire succeed\nThe town, the pasture and the wee"
    },
    {
      "part_id": 5,
      "snippet_id": 2,
      "part_number": 3,
      "content": "d.\nWater and fire deride\nThe sacrifice that we denied.\nWater and fire shall rot\nThe marred foundations we forgot,\nOf sanctuary and choir.\nThis is the death of water and fire.\n\nIn the uncertain hour before the morning\nNear the ending of interminable night\nAt the recurrent end of the unending\nAfter the dark dove with the flickering tongue\nHad passed below the horizon of his homing\nWhile the dead leaves still rattled on like tin\nOver the asphalt where no other sound was\nBetween three districts whence the smoke arose\nI met one walking, loitering and hurried\nAs if blown towards me like the metal leaves\nBefore the urban dawn wind unresisting.\nAnd as I fixed upon the down-turned face\nThat pointed scrutiny with which we challenge\nThe first-met stranger in the waning dusk\nI caught the sudden look of some dead master\nWhom I had known, forgotten, half recalled\nBoth one and many; in the brown baked features\nThe eyes of a familiar compound ghost\nBoth intimate and unidentifiable.\nSo I assumed a doub"
    },
    {
      "part_id": 6,
      "snippet_id": 2,
      "part_number": 4,
      "content": "le part, and cried\nAnd heard another's voice cry: 'What! are you here?'\nAlthough we were not. I was still the same,\nKnowing myself yet being someone other—\nAnd he a face still forming; yet the words sufficed\nTo compel the recognition they preceded.\nAnd so, compliant to the common wind,\nToo strange to each other for misunderstanding,\nIn concord at this intersection time\nOf meeting nowhere, no before and after,\nWe trod the pavement in a dead patrol.\nI said: 'The wonder that I feel is easy,\nYet ease is cause of wonder. Therefore speak:\nI may not comprehend, may not remember.'\nAnd he: 'I am not eager to rehearse\nMy thoughts and theory which you have forgotten.\nThese things have served their purpose: let them be.\nSo with your own, and pray they be forgiven\nBy others, as I pray you to forgive\nBoth bad and good. Last season's fruit is eaten\nAnd the fullfed beast shall kick the empty pail.\nFor last year's words belong to last year's language\nAnd next year's words await another voice.\nBut, as t"
    },
    {
      "part_id": 7,
      "snippet_id": 2,
      "part_number": 5,
      "content": "he passage now presents no hindrance\nTo the spirit unappeased and peregrine\nBetween two worlds become much like each other,\nSo I find words I never thought to speak\nIn streets I never thought I should revisit\nWhen I left my body on a distant shore.\nSince our concern was speech, and speech impelled us\nTo purify the dialect of the tribe\nAnd urge the mind to aftersight and foresight,\nLet me disclose the gifts reserved for age\nTo set a crown upon your lifetime's effort.\nFirst, the cold friction of expiring sense\nWithout enchantment, offering no promise\nBut bitter tastelessness of shadow fruit\nAs body and soul begin to fall asunder.\nSecond, the conscious impotence of rage\nAt human folly, and the laceration\nOf laughter at what ceases to amuse.\nAnd last, the rending pain of re-enactment\nOf all that you have done, and been; the shame\nOf motives late revealed, and the awareness\nOf things ill done and done to others' harm\nWhich once you took for exercise of virtue.\nThen fools' approval stings, a"
    },
    {
      "part_id": 8,
      "snippet_id": 2,
      "part_number": 6,
      "content": "nd honour stains.\nFrom wrong to wrong the exasperated spirit\nProceeds, unless restored by that refining fire\nWhere you must move in measure, like a dancer.'\nThe day was breaking. In the disfigured street\nHe left me, with a kind of valediction,\nAnd faded on the blowing of the horn.\n\n\nIII\n\nThere are three conditions which often look alike\nYet differ completely, flourish in the same hedgerow:\nAttachment to self and to things and to persons, detachment\nFrom self and from things and from persons;\nAnd, growing between them, indifference\nWhich resembles the others as death resembles life,\nBeing between two lives—unflowering, between\nThe live and the dead nettle. This is the use of memory:\nFor liberation—not less of love but expanding\nOf love beyond desire, and so liberation\nFrom the future as well as the past. Thus, love of a country\nBegins as attachment to our own field of action\nAnd comes to find that action of little importance\nThough never indifferent. History may be servitude,\nHistory ma"
    },
    {
      "part_id": 9,
      "snippet_id": 2,
      "part_number": 7,
      "content": "y be freedom. See, now they vanish,\nThe faces and places, with the self which, as it could, loved them,\nTo become renewed, transfigured, in another pattern.\n\nSin is Behovely, but\nAll shall be well, and\nAll manner of thing shall be well.\nIf I think, again, of this place,\nAnd of people, not wholly commendable,\nOf no immediate kin or kindness,\nBut of some peculiar genius,\nAll touched by a common genius,\nUnited in the strife which divided them;\nIf I think of a king at nightfall,\nOf three men, and more, on the scaffold\nAnd a few who died forgotten\nIn other places, here and abroad,\nAnd of one who died blind and quiet\nWhy should we celebrate\nThese dead men more than the dying?\nIt is not to ring the bell backward\nNor is it an incantation\nTo summon the spectre of a Rose.\nWe cannot revive old factions\nWe cannot restore old policies\nOr follow an antique drum.\nThese men, and those who opposed them\nAnd those whom they opposed\nAccept the constitution of silence\nAnd are folded in a single party.\nWhat"
    },
    {
      "part_id": 10,
      "snippet_id": 2,
      "part_number": 8,
      "content": "ever we inherit from the fortunate\nWe have taken from the defeated\nWhat they had to leave us—a symbol:\nA symbol perfected in death.\nAnd all shall be well and\nAll manner of thing shall be well\nBy the purification of the motive\nIn the ground of our beseeching.\n\n\nIV\n\nThe dove descending breaks the air\nWith flame of incandescent terror\nOf which the tongues declare\nThe one discharge from sin and error.\nThe only hope, or else despair\nLies in the choice of pyre of pyre—\nTo be redeemed from fire by fire.\n\nWho then devised the torment? Love.\nLove is the unfamiliar Name\nBehind the hands that wove\nThe intolerable shirt of flame\nWhich human power cannot remove.\nWe only live, only suspire\nConsumed by either fire or fire.\n\n\nV\n\nWhat we call the beginning is often the end\nAnd to make and end is to make a beginning.\nThe end is where we start from. And every phrase\nAnd sentence that is right (where every word is at home,\nTaking its place to support the others,\nThe word neither diffident nor ostentatious"
    },
    {
      "part_id": 11,
      "snippet_id": 2,
      "part_number": 9,
      "content": ",\nAn easy commerce of the old and the new,\nThe common word exact without vulgarity,\nThe formal word precise but not pedantic,\nThe complete consort dancing together)\nEvery phrase and every sentence is an end and a beginning,\nEvery poem an epitaph. And any action\nIs a step to the block, to the fire, down the sea's throat\nOr to an illegible stone: and that is where we start.\nWe die with the dying:\nSee, they depart, and we go with them.\nWe are born with the dead:\nSee, they return, and bring us with them.\nThe moment of the rose and the moment of the yew-tree\nAre of equal duration. A people without history\nIs not redeemed from time, for history is a pattern\nOf timeless moments. So, while the light fails\nOn a winter's afternoon, in a secluded chapel\nHistory is now and England.\n\nWith the drawing of this Love and the voice of this\nCalling\n\nWe shall not cease from exploration\nAnd the end of all our exploring\nWill be to arrive where we started\nAnd know the place for the first time.\nThrough the un"
    },
    {
      "part_id": 12,
      "snippet_id": 2,
      "part_number": 10,
      "content": "known, unremembered gate\nWhen the last of earth left to discover\nIs that which was the beginning;\nAt the source of the longest river\nThe voice of the hidden waterfall\nAnd the children in the apple-tree\nNot known, because not looked for\nBut heard, half-heard, in the stillness\nBetween two waves of the sea.\nQuick now, here, now, always—\nA condition of complete simplicity\n(Costing not less than everything)\nAnd all shall be well and\nAll manner of thing shall be well\nWhen the tongues of flame are in-folded\nInto the crowned knot of fire\nAnd the fire and the rose are one."
    },
    {
      "part_id": 13,
      "snippet_id": 3,
      "part_number": 0,
      "content": "import numpy as np\n\n# Create an array\narray = np.array([1, 2, 3, 4, 5])\n\n# Perform basic operations\nmean = np.mean(array)\nsum_array = np.sum(array)\n\nprint(f\"Mean: {mean}, Sum: {sum_array}\")\n\nimport pandas as pd\n\n# Create a DataFrame\ndata = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}\ndf = pd.DataFrame(data)\n\n# Perform basic operations\naverage_age = df['Age'].mean()\ndf['Age'] = df['Age'] + 1  # Increment age by 1\n\nprint(f\"Average Age: {average_age}\")\nprint(df)"
    },
    {
      "part_id": 14,
      "snippet_id": 4,
      "part_number": 0,
      "content": "Manifesto for Agile Software Development\n\nWe are uncovering better ways of developing\nsoftware by doing it and helping others do it.\nThrough this work we have come to value:\n\nIndividuals and interactions over processes and tools\nWorking software over comprehensive documentation\nCustomer collaboration over contract negotiation\nResponding to change over following a plan\n\nThat is, while there is value in the items on\nthe right, we value the items on the left more."
    },
    {
      "part_id": 15,
      "snippet_id": 5,
      "part_number": 0,
      "content": "Principles behind the Agile Manifesto\n\nWe follow these principles:\nOur highest priority is to satisfy the customer\nthrough early and continuous delivery\nof valuable software.\n\nWelcome changing requirements, even late in\ndevelopment. Agile processes harness change for\nthe customer's competitive advantage.\n\nDeliver working software frequently, from a\ncouple of weeks to a couple of months, with a\npreference to the shorter timescale.\n\nBusiness people and developers must work\ntogether daily throughout the project.\n\nBuild projects around motivated individuals.\nGive them the environment and support they need,\nand trust them to get the job done.\n\nThe most efficient and effective method of\nconveying information to and within a development\nteam is face-to-face conversation.\n\nWorking software is the primary measure of progress.\n\nAgile processes promote sustainable development.\nThe sponsors, developers, and users should be able\nto maintain a constant pace indefinitely.\n\nContinuous attention to tec"
    },
    {
      "part_id": 16,
      "snippet_id": 5,
      "part_number": 1,
      "content": "hnical excellence\nand good design enhances agility.\n\nSimplicity--the art of maximizing the amount\nof work not done--is essential.\n\nThe best architectures, requirements, and designs\nemerge from self-organizing teams.\n\nAt regular intervals, the team reflects on how\nto become more effective, then tunes and adjusts\nits behavior accordingly."
    },
    {
      "part_id": 17,
      "snippet_id": 6,
      "part_number": 0,
      "content": "ab"
    },
    {
      "part_id": 18,
      "snippet_id": 7,
      "part_number": 0,
      "content": "a"
    },
    {
      "part_id": 49,
      "snippet_id": 18,
      "part_number": 0,
      "content": "abc"
    },
    {
      "part_id": 50,
      "snippet_id": 19,
      "part_number": 0,
      "content": "abcd"
    }
  ]
}